In [16]:
import pandas as pd
import numpy as np
user_data={
    'MarksA':np.random.randint(1,100,5),
    'MarksB':np.random.randint(50,100,5)
}
user_data

{'MarksA': array([68, 69, 72,  5, 23]), 'MarksB': array([84, 74, 69, 81, 76])}

In [18]:
df=pd.DataFrame(user_data)
print(df)

   MarksA  MarksB
0      68      84
1      69      74
2      72      69
3       5      81
4      23      76

In [19]:
df.head()

   MarksA  MarksB
0      68      84
1      69      74
2      72      69
3       5      81
4      23      76

In [20]:
df.columns

Index(['MarksA', 'MarksB'], dtype='object')

In [21]:
df.to_csv('marks_csv')
my_data=pd.read_csv('marks_csv')
my_data=my_data.drop(columns=['Unnamed: 0'])
my_data

   MarksA  MarksB
0      68      84
1      69      74
2      72      69
3       5      81
4      23      76

In [22]:
my_data.describe()

          MarksA     MarksB
count   5.000000   5.000000
mean   47.400000  76.800000
std    31.181725   5.890671
min     5.000000  69.000000
25%    23.000000  74.000000
50%    68.000000  76.000000
75%    69.000000  81.000000
max    72.000000  84.000000

In [23]:
 my_data.tail(3)

   MarksA  MarksB
2      72      69
3       5      81
4      23      76

In [24]:
df

   MarksA  MarksB
0      68      84
1      69      74
2      72      69
3       5      81
4      23      76

In [25]:
df.iloc[3,1]

81

In [30]:
idx =[df.columns.get_loc('MarksB'),df.columns.get_loc('MarksA')]
print(idx)

[1, 0]

In [31]:
df.iloc[3,idx]

MarksB    81
MarksA     5
Name: 3, dtype: int32

In [34]:
df.iloc[:3,idx]

   MarksB  MarksA
0      84      68
1      74      69
2      69      72

In [35]:
my_data.sort_values(by=['MarksA'])

   MarksA  MarksB
3       5      81
4      23      76
0      68      84
1      69      74
2      72      69

In [36]:
import pandas as pd
import matplotlib.pyplot as plt